app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
	def index

		@post = Post.all

INSERT INTO `posts` (`title`, `text`, `created_at`, `updated_at`) VALUES ('tyt', 'tyty', '2019-10-04 07:31:56', '2019-10-04 07:31:56')
---
	def create

		#@post = Post.create(title: params[:posts][:title], text: params[:posts][:text])

		@post = Post.new(params.require(:posts).permit(:title, :text))

		@post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
UPDATE `posts` SET `title` = 'fgnX', `text` = 'nfhXXX', `updated_at` = '2019-10-04 10:33:40' WHERE `posts`.`id` = 7
---
	def update
		@post = Post.find(params[:id])

		if @post.update(params.require(:post).permit(:title, :text))